Public Attributes | List of all members
API_ProjectNoteInfo Struct Reference
Project Settings
Project note information parameters. More...
#include <APIdefs_Environment.h>
 Public Attributes
char  | client [256]
The name of the client.
char  | projectName [256]
The name of the project.
char  | company [256]
The company working on the project.
char  | street [256]
Street address.
char  | city [256]
City name..
char  | country [256]
State or country.
char  | code [256]
Postal code.
char  | architect [256]
Main architect(s).
char  | draftsmen [256]
Drafts person.
char  | projectStatus [256]
Status of the project as text.
char  | dateOfIssue [256]
Issue date.
char  | keywords [256]
Other keywords related to the project.
char  | notes [1024]
Notes for the project info.
Detailed Description
Project note information parameters.
Remarks
The data structure members correspond to the items of the "Project Info..." dialog of Archicad. This information can be used for autotext entries in text elements. See ACAPI_AutoText_GetAutoTexts for details. Call the ACAPI_ProjectSetting_GetProjectNotes or the ACAPI_ProjectSetting_ChangeProjectNotes functions to operate on this data. The same behavior can be achieved with the autotext functions: ACAPI_AutoText_GetAutoTexts, ACAPI_AutoText_SetAnAutoText. The main difference is that the autotext functions work on Unicode strings, whereas the project notes functions use UTF-8 encoded strings.
Member Data Documentation
◆ architect
 API_ProjectNoteInfo::architect
Main architect(s).
◆ city
 API_ProjectNoteInfo::city
City name..
◆ client
 API_ProjectNoteInfo::client
The name of the client.
◆ code
 API_ProjectNoteInfo::code
Postal code.
◆ company
 API_ProjectNoteInfo::company
The company working on the project.
◆ country
 API_ProjectNoteInfo::country
State or country.
◆ dateOfIssue
 API_ProjectNoteInfo::dateOfIssue
Issue date.
◆ draftsmen
 API_ProjectNoteInfo::draftsmen
Drafts person.
◆ keywords
 API_ProjectNoteInfo::keywords
Other keywords related to the project.
◆ notes
 API_ProjectNoteInfo::notes
Notes for the project info.
◆ projectName
 API_ProjectNoteInfo::projectName
The name of the project.
◆ projectStatus
 API_ProjectNoteInfo::projectStatus
Status of the project as text.
◆ street
 API_ProjectNoteInfo::street
Street address.